# DirectContext3DHandleSettings Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectContext3DHandleSettings Constructor
DirectContext3DHandleSettings Class See Also
---
Constructs an instance of settings with default values.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public DirectContext3DHandleSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
DirectContext3DHandleSettings()
```

# See Also
DirectContext3DHandleSettings Class
DirectContext3DHandleSettings Overload
Autodesk.Revit.DB.DirectContext3D Namespace